TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                         PC v7.4.18 *
       3                    ;* Date/Time created: Tue Jan 02 08:53:48 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=coffabi --c64p_l1d_workaround=default --endian=little --hll_source=on --l
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C671x                                          *
      11                    ;*   Optimization      : Enabled at level 2                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    1573 000005e8 02102FDA             OR      .L2     1,B4,B4           ; |350| 
    1574 000005ec 009003A2             MVC     .S2     B4,CSR            ; |350| 
    1575 000005f0 00000000             NOP             1
    1576                            .dwpsn  file "C:/ti/CCCStudio_v3.1/C6000/csl/include/csl_irq.h",line 375,column 3,is_stmt
    1577 000005f4 021003E2             MVC     .S2     IER,B4            ; |375| 
    1578 000005f8 02104FDA             OR      .L2     2,B4,B4           ; |375| 
    1579 000005fc 021003A2             MVC     .S2     B4,IER            ; |375| 
    1580 00000600 00000000             NOP             1
    1581                            .dwpsn  file "C:/ti/CCCStudio_v3.1/C6000/csl/include/csl_irq.h",line 320,column 3,is_stmt
    1582 00000604 021003E2             MVC     .S2     IER,B4            ; |320| 
    1583 00000608 020C9FFA             OR      .L2X    A3,B4,B4          ; |320| 
    1584 0000060c 021003A2             MVC     .S2     B4,IER            ; |320| 
    1585 00000610 00000000             NOP             1
    1586                            .dwpsn  file "../c6713dskinit.c",line 42,column 2,is_stmt
    1587                    $C$DW$78        .dwtag  DW_TAG_TI_branch
    1588                            .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    1589                            .dwattr $C$DW$78, DW_AT_name("_output_sample")
    1590                            .dwattr $C$DW$78, DW_AT_TI_call
    1591 00000614 0FFF4010             CALL    .S1     _output_sample    ; |42| 
    1592 00000618 0183142A'            MVKL    .S2     $C$RL7,B3         ; |42| 
    1593 0000061c 0180006A'            MVKH    .S2     $C$RL7,B3         ; |42| 
    1594 00000620 020000F8             ZERO    .L1     A4                ; |42| 
    1595 00000624 00002000             NOP             2
TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE   30

    1596 00000628           $C$RL7:    ; CALL OCCURS {_output_sample} {0}  ; |42| 
    1597                    ;** --------------------------------------------------------------------------*
    1598                            .dwpsn  file "../c6713dskinit.c",line 43,column 1,is_stmt
    1599 00000628 053C22E4             LDW     .D2T1   *+SP(4),A10       ; |43| 
    1600                            .dwcfi  restore_reg, 10
    1601 0000062c 01BC52E6             LDW     .D2T2   *++SP(8),B3       ; |43| 
    1602 00000630 00006000             NOP             4
    1603                            .dwcfi  cfa_offset, 0
    1604                            .dwcfi  restore_reg, 19
    1605                            .dwcfi  cfa_offset, 0
    1606                    $C$DW$79        .dwtag  DW_TAG_TI_branch
    1607                            .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1608                            .dwattr $C$DW$79, DW_AT_TI_return
    1609 00000634 000C0362             RET     .S2     B3                ; |43| 
    1610 00000638 00008000             NOP             5
    1611                               ; BRANCH OCCURS {B3}              ; |43| 
    1612                            .dwattr $C$DW$75, DW_AT_TI_end_file("../c6713dskinit.c")
    1613                            .dwattr $C$DW$75, DW_AT_TI_end_line(0x2b)
    1614                            .dwattr $C$DW$75, DW_AT_TI_end_column(0x01)
    1615                            .dwendentry
    1616                            .dwendtag $C$DW$75
    1617                    
    1618                    ;*****************************************************************************
    1619                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1620                    ;*****************************************************************************
    1621                            .global _IRQ_map
    1622                            .global _DSK6713_init
    1623                            .global _MCBSP_start
    1624                            .global _DSK6713_AIC23_openCodec
    1625                            .global _DSK6713_AIC23_setFreq
    1626                            .global __IRQ_eventTable
    1627                            .global _DSK6713_AIC23_codecdatahandle
    1628                            .global _fs
    1629                    
    1630                    ;******************************************************************************
    1631                    ;* BUILD ATTRIBUTES                                                           *
    1632                    ;******************************************************************************
    1633                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_needed(0)
    1634                            .battr "TI", Tag_File, 1, Tag_ABI_stack_align_preserved(0)
    1635                            .battr "TI", Tag_File, 1, Tag_Tramps_Use_SOC(0)
    1636                    
    1637                    ;******************************************************************************
    1638                    ;* TYPE INFORMATION                                                           *
    1639                    ;******************************************************************************
    1640                    
    1641                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1642                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
    1643                    $C$DW$80        .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1645                            .dwattr $C$DW$80, DW_AT_name("allocated")
    1646                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("_allocated")
    1647                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1649                    $C$DW$81        .dwtag  DW_TAG_member
    1650                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE   31

    1651                            .dwattr $C$DW$81, DW_AT_name("xmtEventId")
    1652                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("_xmtEventId")
    1653                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1654                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1655                    $C$DW$82        .dwtag  DW_TAG_member
    1656                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1657                            .dwattr $C$DW$82, DW_AT_name("rcvEventId")
    1658                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rcvEventId")
    1659                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1660                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1661                    $C$DW$83        .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1663                            .dwattr $C$DW$83, DW_AT_name("baseAddr")
    1664                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("_baseAddr")
    1665                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1666                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1667                    $C$DW$84        .dwtag  DW_TAG_member
    1668                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1669                            .dwattr $C$DW$84, DW_AT_name("drrAddr")
    1670                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("_drrAddr")
    1671                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1672                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1673                    $C$DW$85        .dwtag  DW_TAG_member
    1674                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1675                            .dwattr $C$DW$85, DW_AT_name("dxrAddr")
    1676                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("_dxrAddr")
    1677                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1678                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1679                            .dwendtag $C$DW$T$22
    1680                    
    1681                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1682                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    1683                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1684                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Handle")
    1685                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1686                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1687                    
    1688                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1689                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    1690                    $C$DW$86        .dwtag  DW_TAG_member
    1691                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1692                            .dwattr $C$DW$86, DW_AT_name("spcr")
    1693                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("_spcr")
    1694                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1696                    $C$DW$87        .dwtag  DW_TAG_member
    1697                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1698                            .dwattr $C$DW$87, DW_AT_name("rcr")
    1699                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rcr")
    1700                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1701                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1702                    $C$DW$88        .dwtag  DW_TAG_member
    1703                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1704                            .dwattr $C$DW$88, DW_AT_name("xcr")
    1705                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("_xcr")
TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE   32

    1706                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1707                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1708                    $C$DW$89        .dwtag  DW_TAG_member
    1709                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1710                            .dwattr $C$DW$89, DW_AT_name("srgr")
    1711                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("_srgr")
    1712                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1713                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1714                    $C$DW$90        .dwtag  DW_TAG_member
    1715                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1716                            .dwattr $C$DW$90, DW_AT_name("mcr")
    1717                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("_mcr")
    1718                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1719                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1720                    $C$DW$91        .dwtag  DW_TAG_member
    1721                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1722                            .dwattr $C$DW$91, DW_AT_name("rcer")
    1723                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rcer")
    1724                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1725                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1726                    $C$DW$92        .dwtag  DW_TAG_member
    1727                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1728                            .dwattr $C$DW$92, DW_AT_name("xcer")
    1729                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("_xcer")
    1730                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1731                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1732                    $C$DW$93        .dwtag  DW_TAG_member
    1733                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1734                            .dwattr $C$DW$93, DW_AT_name("pcr")
    1735                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("_pcr")
    1736                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1737                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwendtag $C$DW$T$23
    1739                    
    1740                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("MCBSP_Config")
    1741                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$23)
    1742                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1743                    
    1744                    $C$DW$T$25      .dwtag  DW_TAG_union_type
    1745                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1746                    $C$DW$94        .dwtag  DW_TAG_member
    1747                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1748                            .dwattr $C$DW$94, DW_AT_name("uint")
    1749                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("_uint")
    1750                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1752                    $C$DW$95        .dwtag  DW_TAG_member
    1753                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    1754                            .dwattr $C$DW$95, DW_AT_name("channel")
    1755                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("_channel")
    1756                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1758                            .dwendtag $C$DW$T$25
    1759                    
    1760                    
TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE   33

    1761                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1762                            .dwattr $C$DW$T$27, DW_AT_name("DSK6713_AIC23_Config")
    1763                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x28)
    1764                    $C$DW$96        .dwtag  DW_TAG_member
    1765                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    1766                            .dwattr $C$DW$96, DW_AT_name("regs")
    1767                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("_regs")
    1768                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1770                            .dwendtag $C$DW$T$27
    1771                    
    1772                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_Config")
    1773                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    1774                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1775                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1776                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1777                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1778                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1779                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1780                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1781                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1782                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1783                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1784                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1785                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1786                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1787                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1788                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1789                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1790                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1791                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1792                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1793                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1794                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1795                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1796                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1797                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1798                    
    1799                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    1800                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$8)
    1801                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1802                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1803                    $C$DW$97        .dwtag  DW_TAG_subrange_type
    1804                            .dwattr $C$DW$97, DW_AT_upper_bound(0x01)
    1805                            .dwendtag $C$DW$T$24
    1806                    
    1807                    $C$DW$T$53      .dwtag  DW_TAG_const_type
    1808                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
    1809                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1810                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1811                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1812                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1813                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1814                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1815                            .dwattr $C$DW$T$10, DW_AT_name("int")
TMS320C6x Assembler PC v7.4.18 Tue Jan 02 08:53:48 2018

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Pc\AppData\Local\Temp\0378410                               PAGE   34

    1816                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1817                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("DSK6713_AIC23_CodecHandle")
